uhnp/src/Enums/ТочностиУказанияСрокаГодности/ТочностиУказанияСрокаГодности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТочностиУказанияСрокаГодности</name>
  <enumValues>
    <name>СТочностьюДоМесяцев</name>
  </enumValues>
  <enumValues>
    <name>СТочностьюДоДней</name>
  </enumValues>
  <enumValues>
    <name>СТочностьюДоЧасов</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТочностиУказанияСрокаГодности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает форматную строку представления срока годности.
//
// Параметры:
//  ТочностьУказанияСрокаГодности - ПеречислениеСсылка.ТочностиУказанияСрокаГодности - точность указания срока годности вида номенклатуры.
// 
// Возвращаемое значение:
//  Строка - форматная строка срока годности вида номенклатуры.
//
Функция ФорматнаяСтрока(ТочностьУказанияСрокаГодности)Экспорт
	
	ФорматнаяСтрока = "";
	
	ШаблонФорматнойСтроки = НСтр("ru = 'ДФ=%ТочностьУказания%';
								|en = 'DF=%ТочностьУказания%'");
	Если ТочностьУказанияСрокаГодности = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоЧасов Тогда
		ФорматнаяСтрока = СтрЗаменить(ШаблонФорматнойСтроки, "%ТочностьУказания%", "'dd.MM.yy HH:00'");
	ИначеЕсли ТочностьУказанияСрокаГодности = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоМесяцев Тогда
		ФорматнаяСтрока = СтрЗаменить(ШаблонФорматнойСтроки, "%ТочностьУказания%", "MM.yy");
	ИначеЕсли ТочностьУказанияСрокаГодности = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоДней Тогда
		ФорматнаяСтрока = СтрЗаменить(ШаблонФорматнойСтроки, "%ТочностьУказания%", "dd.MM.yy");
	КонецЕсли;
	
	Возврат ФорматнаяСтрока;
	
КонецФункции

// Возвращает представление форматной строки для вывода в элементах управления
//
// Параметры:
//  ТочностьУказанияСрокаГодности - ПеречислениеСсылка.ТочностиУказанияСрокаГодности - точность указания срока годности вида номенклатуры.
// 
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеФорматнойСтроки(ТочностьУказанияСрокаГодности)Экспорт
	
	ПредставлениеФорматнойСтроки = "";
	
	Если ТочностьУказанияСрокаГодности = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоЧасов Тогда
		ПредставлениеФорматнойСтроки = НСтр("ru = 'дата, час';
											|en = 'date, hour'");
	ИначеЕсли ТочностьУказанияСрокаГодности = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоМесяцев Тогда
		ПредставлениеФорматнойСтроки = НСтр("ru = 'месяц, год';
											|en = 'month, year'");
	ИначеЕсли ТочностьУказанияСрокаГодности = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоДней Тогда
		ПредставлениеФорматнойСтроки = НСтр("ru = 'дата';
											|en = 'date'");
	КонецЕсли;
	
	Возврат ПредставлениеФорматнойСтроки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
